CONSONANTS = [
    'ක්', 'ඛ්', 'ග්', 'ඝ්', 'ඞ්', 'ඟ්',
    'ච්', 'ඡ්', 'ජ්', 'ඣ්', 'ඤ්', 'ඦ්',
    'ට්', 'ඨ්', 'ඩ්', 'ඪ්', 'ණ්', 'ඬ්',
    'ත්', 'ථ්', 'ද්', 'ධ්', 'න්', 'ඳ්',
    'ප්', 'ඵ්', 'බ්', 'භ්', 'ම්', 'ඹ්',
    'ය්', 'ර්', 'ල්', 'ව්',
    'ශ්', 'ෂ්', 'ස්', 'හ්', 'ළ්', 'ෆ්',
    'ං', 'ඃ'
]

BASE_CONSONANTS = [
    'ක', 'ඛ', 'ග', 'ඝ', 'ඞ', 'ඟ',
    'ච', 'ඡ', 'ජ', 'ඣ', 'ඤ', 'ඦ',
    'ට', 'ඨ', 'ඩ', 'ඪ', 'ණ', 'ඬ',
    'ත', 'ථ', 'ද', 'ධ', 'න', 'ඳ',
    'ප', 'ඵ', 'බ', 'භ', 'ම', 'ඹ',
    'ය', 'ර', 'ල', 'ව',
    'ශ', 'ෂ', 'ස', 'හ', 'ළ', 'ෆ',
    'ං', 'ඃ'
]

VOWELS = [
    'අ', 'ආ', 'ඇ', 'ඈ', 'ඉ', 'ඊ', 'උ', 'ඌ',
    'ඍ', 'ඎ', 'එ', 'ඒ', 'ඓ', 'ඔ', 'ඕ', 'ඖ',
    # 'අං', 'අඃ',
]

VOWEL_DIACRITICS = [
    '', 'ා', 'ැ', 'ෑ', 'ි', 'ී', 'ු', 'ූ',
    'ෘ', 'ෲ', 'ෙ', 'ේ', 'ෛ', 'ො', 'ෝ', 'ෞ',
    # 'ං', 'ඃ'
]

VOWEL_DIACRITICS_MAPPING = {v: d for v, d in zip(VOWELS, VOWEL_DIACRITICS)}

VOWEL_REVERSE_DIACRITICS_MAPPING = {d: v for v, d in zip(VOWELS, VOWEL_DIACRITICS)}
